import kagglehub

path = kagglehub.dataset_download("hojjatk/mnist-dataset")
print(path)
#Создайте директорию data в корне проекта и перенесите туда датасэт